chat_system_1825384748_actor_description=Master Trigius. Head of Magic Academy.
chat_system_1825384748_snap_win_question=^?^Well, did you like it? I see you have successfully tried out the Arena. This will significantly assist us in our innovations. We thank you, and will be always glad to see you in our Academy.<br>[reward]
chat_system_1825384748_snap_win_answer_0=^?^Yeah, thanks. That was an incredible test.
chat_system_1825384748_snap_5_question=^?^I remind you that you need to defeat all the keepers. I advise you to start with the evil gremlins - they will disable your troops and use combat spells. Friendly gremlins are more concerned about their protection: they will summon allies and reinforce them with its magic.
chat_system_1825384748_snap_5_answer_0=^?^Ok, let's start the test, I'm intrigued.
chat_system_1825384748_snap_5_answer_1=^?^Let me think for a while.
chat_system_1825384748_snap_0_question=^?^First I'll tell you about Darion magic. In contrast to Kordar, where dwarves haven't used magic for several thousand years, instead relying on technics - and in contrast to Ellinia, where elves completely depend on the magic of their forests - Darion uses magic quite reasonably. We use dwarven mechanisms and at the same time perform magical experiments. We use magic in our daily lives quite successfully.<br>Do you wish to listen further?
chat_system_1825384748_snap_0_answer_0=^?^Yes, sure.
chat_system_1825384748_snap_1_question=^?^Over the last thousand years we have advanced in our research significantly. We managed to use this long period to study some of the demonic artifacts captured by Kerus Leonard. But we have made especially great progress in the creation of "living" items. And if you want to earn some money, your mission will be connected with this area of our research.
chat_system_1825384748_snap_1_answer_0=^?^Tell me more about it.
chat_system_1825384748_snap_2_question=^?^Nowadays the main magic trend is the creation of living items that have a soul of their own. Such artifacts are much more powerful than common enchanted items.<br>Today in the Magic Tower we create the best magical items in Endoria. They must pass through the most severe tests before mass production.<br>If you want to help, I can offer you to test the Judgment Day Arena. It's for half-finished living items, and we would like to know how hard it will be to defeat the keepers of the item.
chat_system_1825384748_snap_2_answer_0=^?^Sounds very interesting. What should I do?
chat_system_1825384748_snap_3_question=^?^We created the item on the basis of the half-finished product. You are simply to try to suppress this item, defeating its keepers in the Arena.<br>But there is one special feature. You can't run away from this Arena. It's win or die! That is why we called it Judgment Day Arena.<br>So, do you still want to try your hand?<br>[reward]
chat_system_1825384748_snap_3_answer_0=^?^Yes, I'm ready for combat - it sounds very interesting.
chat_system_1825384748_snap_3_answer_1=^?^Judgment Day Arena? Maybe next time.
